Repository: Gallaecio/scrapy
Catalog: docs/locales/*/LC_MESSAGES/intro/tutorial.po
Languages: gl

source: Scrapy Tutorial
gl: Titorial de Scrapy

source: In this tutorial, we'll assume that Scrapy is already installed on your system. If that's not the case, see :ref:`intro-install`.
gl: Neste titorial enténdese que Scrapy xa está instalado no sistema. Se non o ten instalado, consulte :ref:`intro-install`.

source: We are going to scrape `quotes.toscrape.com <http://quotes.toscrape.com/>`_, a website that lists quotes from famous authors.
gl: Imos extraer datos de `quotes.toscrape.com <http://quotes.toscrape.com/>`_, un sitio web que lista citas de autores famosos.

source: This tutorial will walk you through these tasks:
gl: Este titorial serviralle de guía para os seguintes pasos:

source: Creating a new Scrapy project
gl: Crear un novo proxecto de Scrapy

source: Writing a :ref:`spider <topics-spiders>` to crawl a site and extract data
gl: Escribir unha :ref:`araña <topics-spiders>` para percorrer un sitio e extraer datos

source: Exporting the scraped data using the command line
gl: Exportar os datos extraídos usando a liña de ordes

source: Changing spider to recursively follow links
gl: Cambiar a araña para seguir ligazóns de maneira recursiva

source: Using spider arguments
gl: Usar parámetros de arañas

source: Scrapy is written in Python_. If you're new to the language you might want to start by getting an idea of what the language is like, to get the most out of Scrapy.
gl: Scrapy está escrito en Python_. Se non ten familiaridade coa linguaxe, quizá lle interese empezar a facerse unha idea de como é, para poder sacarlle o maior partido a Scrapy.

source: If you're already familiar with other languages, and want to learn Python quickly, the `Python Tutorial <Python Tutorial>`__ is a good resource.
gl: Se xa ten experiencia con outras linguaxes, e quere aprender Python rapidamente, un bo recurso sería o `titorial de Python (en inglés) <Python Tutorial>`__.

source: If you're new to programming and want to start with Python, the following books may be useful to you:
gl: Se é a primeira vez que programa e quere empezar con Python, pode que os seguintes libros lle resulten de utilidade:

source: `Automate the Boring Stuff With Python <Automate the Boring Stuff With Python>`__
gl: `Automatizar as cousas aburridas con Python (en inglés) <Automate the Boring Stuff With Python>`__

source: `How To Think Like a Computer Scientist <How To Think Like a Computer Scientist>`__
gl: `Como pensar como un científico informático (en inglés) <How To Think Like a Computer Scientist>`__

source: `Learn Python 3 The Hard Way <Learn Python 3 The Hard Way>`__
gl: `Aprender Python 3 polas malas (en inglés) <Learn Python 3 The Hard Way>`__

source: You can also take a look at `this list of Python resources for non-programmers <this list of Python resources for non-programmers>`__, as well as the `suggested resources in the learnpython-subreddit <suggested resources in the learnpython-subreddit>`__.
gl: Tamén pode botarlle unha ollada a `esta lista de recursos de Python para xente que non sabe programar <this list of Python resources for non-programmers>`__, así como os `recursos suxeridos pola sección de Reddit sobre aprender Python <suggested resources in the learnpython-subreddit>`__.

source: Creating a project
gl: Crear un proxecto

source: Before you start scraping, you will have to set up a new Scrapy project. Enter a directory where you'd like to store your code and run::
gl: Antes de empezar a extraer datos de Internet terá que preparar un proxecto de Scrapy. Entre no directorio no que queira almacenar o seu código e execute::

source: This will create a ``tutorial`` directory with the following contents::
gl: Isto creará un directorio chamado ``tutorial`` co seguinte contido::

source: Our first Spider
gl: A nosa primeira araña

source: Spiders are classes that you define and that Scrapy uses to scrape information from a website (or a group of websites). They must subclass :class:`~scrapy.spiders.Spider` and define the initial requests to make, optionally how to follow links in the pages, and how to parse the downloaded page content to extract data.
gl: As arañas son clases que vostede define e que Scrapy usa para extraer información dun sitio web (ou dun grupo deles). Deben ser subclases de :class:`~scrapy.spiders.Spider` e definir a solicitude inicial, e de maneira opcional como seguir ligazóns das páxinas, e como analizar o contido das páxinas descargadas para extraer datos.

source: This is the code for our first Spider. Save it in a file named ``quotes_spider.py`` under the ``tutorial/spiders`` directory in your project::
gl: Este é o código para a súa primeira araña. Gárdeo nun ficheiro chamado ``quotes_spider.py`` dentro do directorio ``tutorial/spiders`` do seu proxecto::

source: As you can see, our Spider subclasses :class:`scrapy.Spider <scrapy.spiders.Spider>` and defines some attributes and methods:
gl: Como pode comprobar, a nosa araña é unha subclase de :class:`scrapy.Spider <scrapy.spiders.Spider>` e define algúns atributos e métodos:

source: :attr:`~scrapy.spiders.Spider.name`: identifies the Spider. It must be unique within a project, that is, you can't set the same name for different Spiders.
gl: :attr:`~scrapy.spiders.Spider.name`: identifica a araña. Debe ser único dentro do proxecto, é dicir, non pode usar o mesmo valor para arañas distintas.

source: :meth:`~scrapy.spiders.Spider.start_requests`: must return an iterable of Requests (you can return a list of requests or write a generator function) which the Spider will begin to crawl from. Subsequent requests will be generated successively from these initial requests.
gl: :meth:`~scrapy.spiders.Spider.start_requests`: debe devolver un iterable de instancias de Request (pode devolver unha lista ou escribir unha función xeradora), que serán as solicitudes iniciais do percorrido da araña. O resto de solicitudes xerarase a raíz das respostas a estas solicitudes iniciais.

source: :meth:`~scrapy.spiders.Spider.parse`: a method that will be called to handle the response downloaded for each of the requests made. The response parameter is an instance of :class:`~scrapy.http.TextResponse` that holds the page content and has further helpful methods to handle it.
gl: :meth:`~scrapy.spiders.Spider.parse`: un método ao que se chamará para xestionar a resposta descargada para cada unha das solicitudes realizadas. O parámetro ``response`` é unha instancia de :class:`~scrapy.http.TextResponse` co contido da páxina e métodos adicionais útiles para manexalo.

source: The :meth:`~scrapy.spiders.Spider.parse` method usually parses the response, extracting the scraped data as dicts and also finding new URLs to follow and creating new requests (:class:`~scrapy.http.Request`) from them.
gl: O método :meth:`~scrapy.spiders.Spider.parse` adoita analizar a resposta, extraer os datos como dicionarios e atopar novos URL que seguir mediante novas solicitudes (:class:`~scrapy.http.Request`).

source: How to run our spider
gl: Como executar a nosa araña

source: To put our spider to work, go to the project's top level directory and run::
gl: Para poñer en funcionamento a nosa araña, vaia ao directorio raíz do proxecto e execute::

source: This command runs the spider with name ``quotes`` that we've just added, that will send some requests for the ``quotes.toscrape.com`` domain. You will get an output similar to this::
gl: Esta orde executa a araña nomeada ``quotes`` que acabamos de engadir, que enviará algunhas solicitudes ao dominio ``quotes.toscrape.com``. Obterá unha saída similar á seguinte::

source: Now, check the files in the current directory. You should notice that two new files have been created: *quotes-1.html* and *quotes-2.html*, with the content for the respective URLs, as our ``parse`` method instructs.
gl: A continuación revise os ficheiros do directorio actual. Deberon crearse dous novos ficheiros: *quotes-1.html* e *quotes-2.html*, co contido dos URL correspondentes, tal e como ordena o noso método ``parse``.

source: If you are wondering why we haven't parsed the HTML yet, hold on, we will cover that soon.
gl: Se se pregunta por que aínda non analizamos o HTML, acougue, non habemos tardar en tratar ese tema.

source: What just happened under the hood?
gl: Que acaba de pasar internamente?

source: Scrapy schedules the :class:`scrapy.Request <scrapy.http.Request>` objects returned by the ``start_requests`` method of the Spider. Upon receiving a response for each one, it instantiates :class:`~scrapy.http.Response` objects and calls the callback method associated with the request (in this case, the ``parse`` method) passing the response as argument.
gl: Scrapy planifica os obxectos :class:`scrapy.Request <scrapy.http.Request>` que devolve o método ``start_requests`` da araña. Ao recibir a resposta a cada un, crea un obxecto :class:`~scrapy.http.Response` e chama ao método de devolución de chamada asociado coa solicitude (neste caso, o método ``parse``) pasando a resposta como argumento.

source: A shortcut to the start_requests method
gl: Un atallo para o método start_requests

source: Instead of implementing a :meth:`~scrapy.spiders.Spider.start_requests` method that generates :class:`scrapy.Request <scrapy.http.Request>` objects from URLs, you can just define a :attr:`~scrapy.spiders.Spider.start_urls` class attribute with a list of URLs. This list will then be used by the default implementation of :meth:`~scrapy.spiders.Spider.start_requests` to create the initial requests for your spider::
gl: En vez de codificar un método :meth:`~scrapy.spiders.Spider.start_requests` que xera obxectos :class:`scrapy.Request <scrapy.http.Request>` a partir de varias URL, pode definir un atributo de clase :attr:`~scrapy.spiders.Spider.start_urls` cunha lista de URL. A lista a usará o método :meth:`~scrapy.spiders.Spider.start_requests` predeterminado para crear as solicitudes iniciais da túa araña::

source: The :meth:`~scrapy.spiders.Spider.parse` method will be called to handle each of the requests for those URLs, even though we haven't explicitly told Scrapy to do so. This happens because :meth:`~scrapy.spiders.Spider.parse` is Scrapy's default callback method, which is called for requests without an explicitly assigned callback.
gl: Chamarase ao método :meth:`~scrapy.spiders.Spider.parse` para manexar cada unha das respostas ás solicitudes deses URL, aínda que non llo indicásemos de maneira explícita a Scrapy. Isto é porque :meth:`~scrapy.spiders.Spider.parse` é o método de devolución de chamada predeterminado de Scrapy, ao que se chama por cada resposta a unha solicitude sen unha devolución de chamada asignada.

source: Extracting data
gl: Extraer datos

source: The best way to learn how to extract data with Scrapy is trying selectors using the :ref:`Scrapy shell <topics-shell>`. Run::
gl: A mellor forma de aprender a extraer datos con Scrapy é probar selectores mediante o :ref:`intérprete de Scrapy <topics-shell>`. Execute::

source: Remember to always enclose urls in quotes when running Scrapy shell from command-line, otherwise urls containing arguments (i.e. ``&`` character) will not work.
gl: Non esqueza pór sempre entre comiñas os URL ao executar o intérprete de Scrapy desde a liña de ordes, senón os URL con argumentos (é dicir, co carácter ``&``) non funcionarán.

source: On Windows, use double quotes instead::
gl: En Windows, use comiñas dobres::

source: You will see something like::
gl: Verá algo como::

source: Using the shell, you can try selecting elements using `CSS`_ with the response object:
gl: Co intérprete pode intentar seleccionar elementos usando `CSS`_ co obxecto de resposta:

source: The result of running ``response.css('title')`` is a list-like object called :class:`~scrapy.selector.SelectorList`, which represents a list of :class:`~scrapy.selector.Selector` objects that wrap around XML/HTML elements and allow you to run further queries to fine-grain the selection or extract the data.
gl: O resultado de executar ``response.css('title')`` é un obxecto similar a unha lista chamado :class:`~scrapy.selector.SelectorList`, que representa a lista de obxectos :class:`~scrapy.selector.Selector` que representan elementos de XML ou HTML e lle permiten realizar consultas adicionais para afinar a selección ou extraer os datos.

source: To extract the text from the title above, you can do:
gl: Para extraer o texto do título de arriba, pode facer o seguinte:

source: There are two things to note here: one is that we've added ``::text`` to the CSS query, to mean we want to select only the text elements directly inside ``<title>`` element. If we don't specify ``::text``, we'd get the full title element, including its tags:
gl: Aquí cómpre salientar dúas cousas: por unha banda acabamos de engadir ``::text`` á consulta de CSS, para indicar que queremos seleccionar só os elementos de texto que estean directamente dentro de elementos ``<title>``. Se non indicamos ``::text``, obteríamos o elemento de título completo, incluídas as etiquetas:

source: The other thing is that the result of calling ``.getall()`` is a list: it is possible that a selector returns more than one result, so we extract them all. When you know you just want the first result, as in this case, you can do:
gl: Pola outra banda, o resultado de chamar a ``.getall()`` é unha lista: pode que o selector devolva máis dun resultado, así que extraémolos todos. Cando saiba que non quere máis que o primeiro resultado, como neste caso, pode facer o seguinte:

source: As an alternative, you could've written:
gl: Alternativamente, puido escribir:

source: However, using ``.get()`` directly on a :class:`~scrapy.selector.SelectorList` instance avoids an ``IndexError`` and returns ``None`` when it doesn't find any element matching the selection.
gl: Porén, ao usar ``.get()`` directamente nunha instancia de :class:`~scrapy.selector.SelectorList` evitamos obter un ``IndexError``, xa que devolve ``None`` cando non atopa ningún elemento que coincida coa selección.

source: There's a lesson here: for most scraping code, you want it to be resilient to errors due to things not being found on a page, so that even if some parts fail to be scraped, you can at least get **some** data.
gl: Velaquí unha lección: na meirande parte do código de extracción de datos, interésanos que o código resista aos errors causados por non atopar cousas nunha páxina, de xeito que aínda que non se poidan extraer todos os datos, polo menos extraeremos **algúns**.

source: Besides the :meth:`~scrapy.selector.SelectorList.getall` and :meth:`~scrapy.selector.SelectorList.get` methods, you can also use the :meth:`~scrapy.selector.SelectorList.re` method to extract using `regular expressions <regular expressions>`__:
gl: Ademais dos métodos :meth:`~scrapy.selector.SelectorList.getall` e :meth:`~scrapy.selector.SelectorList.get`, tamén pode usar o método :meth:`~scrapy.selector.SelectorList.re` para extraer mediante `expresións regulares <regular expressions>`__:

source: In order to find the proper CSS selectors to use, you might find useful opening the response page from the shell in your web browser using ``view(response)``. You can use your browser's developer tools to inspect the HTML and come up with a selector (see :ref:`topics-developer-tools`).
gl: Para atopar os selectores CSS axeitados para usar, pode que lle resulte útil abrir a páxina de resposta desde o intérprete no seu navegador web mediante ``view(response)``. Pode usar as ferramentas para desenvolvedores para inspeccionar o HTML e pensar un selector (consulte :ref:`topics-developer-tools`).

source: `Selector Gadget`_ is also a nice tool to quickly find CSS selector for visually selected elements, which works in many browsers.
gl: `Selector Gadget`_ tamén é unha ferramenta útil para atopar rapidamente un selector de CSS para elementos seleccionados visualmente, e funciona en moitos navegadores.

source: XPath: a brief intro
gl: Unha breve introdución a XPath

source: Besides `CSS`_, Scrapy selectors also support using `XPath`_ expressions:
gl: Ademais de `CSS`_, os selectores de Scrapy tamén permiten usar expresións de `XPath`_:

source: XPath expressions are very powerful, and are the foundation of Scrapy Selectors. In fact, CSS selectors are converted to XPath under-the-hood. You can see that if you read closely the text representation of the selector objects in the shell.
gl: As expresións de XPath son moi potentes, e o piar sobre o que repousan os selectores de Scrapy. De feito, os selectores de CSS convértense a XPath internamente. Pode comprobalo se olla detidamente a representación de texto dos obxectos de selector no intérprete.

source: While perhaps not as popular as CSS selectors, XPath expressions offer more power because besides navigating the structure, it can also look at the content. Using XPath, you're able to select things like: *select the link that contains the text "Next Page"*. This makes XPath very fitting to the task of scraping, and we encourage you to learn XPath even if you already know how to construct CSS selectors, it will make scraping much easier.
gl: Aínda que non son tan populares coma os selectores de CSS, as expresións de XPath ofrecen máis potencia porque ademais de navegar a estrutura tamén pode consultar o contido. Con XPath pode seleccionar cousas como: *a ligazón que contén o texto «Páxina seguinte»*. Isto fai a XPath moi axeitado para a extracción de datos, e recomendámoslle que aprenda XPath incluso se xa sabe construír selectores de CSS, facilitaralle moito a extracción de datos.

source: We won't cover much of XPath here, but you can read more about :ref:`using XPath with Scrapy Selectors here <topics-selectors>`. To learn more about XPath, we recommend `this tutorial to learn XPath through examples <http://zvon.org/comp/r/tut-XPath_1.html>`_, and `this tutorial to learn "how to think in XPath" <http://plasmasturm.org/log/xpath101/>`_.
gl: Aquí nos vamos entrar en moito detalle sobre XPath, pero pode ler máis sobre o :ref:`uso de XPath con selectores de Scrapy aquí <topics-selectors>`. Para aprender máis sobre XPath, recomendámoslle `este titorial para aprender XPath mediante exemplos (en inglés) <http://zvon.org/comp/r/tut-XPath_1.html>`_, e `estoutro titorial para aprender a «pensar en XPath» (en inglés) <http://plasmasturm.org/log/xpath101/>`_.

source: Extracting quotes and authors
gl: Extraer citas e autores

source: Now that you know a bit about selection and extraction, let's complete our spider by writing the code to extract the quotes from the web page.
gl: Agora que xa sabe un pouco sobre seleccionar e extraer, completemos a araña escribindo o código para extraer as citas da páxina web.

source: Each quote in http://quotes.toscrape.com is represented by HTML elements that look like this:
gl: Cada cita de http://quotes.toscrape.com está representada por elementos de HTML co seguinte aspecto:

source: Let's open up scrapy shell and play a bit to find out how to extract the data we want::
gl: Abramos o intérprete de Scrapy e fozar un pouco ata atopar como extraer os datos que queremos::

source: We get a list of selectors for the quote HTML elements with:
gl: Para obter unha lista de selectores dos elementos de HTML de cita usamos:

source: Each of the selectors returned by the query above allows us to run further queries over their sub-elements. Let's assign the first selector to a variable, so that we can run our CSS selectors directly on a particular quote:
gl: Cada un dos selectores que a consulta anterior devolve permítenos realizar consultas adicionais nos seus elementos subordinados. Asignemos o primeiro selector a unha variable, para podermos executar os nosos selectores de CSS directamente nunha cita concreta:

source: Now, let's extract ``text``, ``author`` and the ``tags`` from that quote using the ``quote`` object we just created:
gl: Agora extraiamos ``text``, ``author`` e ``tags`` desa cita usando o obxecto ``quote`` que acabamos de crear:

source: Given that the tags are a list of strings, we can use the ``.getall()`` method to get all of them:
gl: Dado que as etiquetas son unha lista de cadeas, podemos usar o método ``.getall()`` para obtelas todas:

source: Having figured out how to extract each bit, we can now iterate over all the quotes elements and put them together into a Python dictionary:
gl: Unha vez sabemos como extraer cada parte, podemos percorrer todos os elementos de cita e xuntalos nun dicionario de Python:

source: Extracting data in our spider
gl: Extraer datos desde a nosa araña

source: Let's get back to our spider. Until now, it doesn't extract any data in particular, just saves the whole HTML page to a local file. Let's integrate the extraction logic above into our spider.
gl: Volvamos á nosa araña. De momento non extrae ningún dato concreto, simplemente garda a páxina de HTML enteira nun ficheiro local. Integremos a lóxica de extracción anterior na nosa araña.

source: A Scrapy spider typically generates many dictionaries containing the data extracted from the page. To do that, we use the ``yield`` Python keyword in the callback, as you can see below::
gl: Unha araña de Scrapy adoita xerar moitos dicionarios cos datos extraídos da páxina. Para facelo, usamos a palabra clave de Python ``yield`` na devolución de chamara, como pode ver a continuación::

source: If you run this spider, it will output the extracted data with the log::
gl: Se executa esta araña, imprimirá na saída os datos extraídos co rexistro::

source: Storing the scraped data
gl: Almacenar os datos extraídos

source: The simplest way to store the scraped data is by using :ref:`Feed exports <topics-feed-exports>`, with the following command::
gl: A forma máis sinxela de almacenar os datos extraídos é usando as :ref:`exportacións de fontes <topics-feed-exports>`, coa seguinte orde::

source: That will generate an ``quotes.json`` file containing all scraped items, serialized in `JSON`_.
gl: Isto xerará un ficheiro ``quotes.json`` que conterá todos os elementos extraídos, en formato `JSON`_.

source: For historic reasons, Scrapy appends to a given file instead of overwriting its contents. If you run this command twice without removing the file before the second time, you'll end up with a broken JSON file.
gl: Por motivos históricos, Scrapy engade os novos datos ao ficheiro indicado en vez de substituír o seu contido. Se executa esta orde dúas veces sen eliminar o ficheiro antes da segunda execución, o ficheiro JSON resultante non será válido.

source: You can also use other formats, like `JSON Lines`_::
gl: Tamén pode usar outros formatos, como `JSON Lines`_::

source: The `JSON Lines`_ format is useful because it's stream-like, you can easily append new records to it. It doesn't have the same problem of JSON when you run twice. Also, as each record is a separate line, you can process big files without having to fit everything in memory, there are tools like `JQ`_ to help doing that at the command-line.
gl: O formato `JSON Lines`_ é útil porque é similar a unha transmisión, pode engadir facilmente novos rexistros a el. Non sofre do mesmo problema que JSON ao executar dúas veces. Ademais, como cada rexistro está nunha liña de seu, pode procesar ficheiros grandes sen ter que cargar todo en memoria, e existen ferramentas como `JQ`_ que permiten facelo desde a liña de ordes.
