Repository: Gallaecio/scrapy
Catalog: docs/locales/*/LC_MESSAGES/intro/tutorial.po
Languages: gl

source: In small projects (like the one in this tutorial), that should be enough. However, if you want to perform more complex things with the scraped items, you can write an :ref:`Item Pipeline <topics-item-pipeline>`. A placeholder file for Item Pipelines has been set up for you when the project is created, in ``tutorial/pipelines.py``. Though you don't need to implement any item pipelines if you just want to store the scraped items.
gl: En proxectos pequenos, como o deste titorial, debería abondar con iso. Porén, se quere realizar cousas máis complexas cos elementos extraídos, pode crear unha :ref:`canalización de elementos <topics-item-pipeline>`. Ao crear o proxecto xerouse un ficheiro no que definir canalizacións de elementos, ``tutorial/pipelines.py``. Pero non ten por que definir ningunha canalización de elementos se non quere máis que almacenar os elementos extraídos.

source: Following links
gl: Seguir ligazóns

source: Let's say, instead of just scraping the stuff from the first two pages from http://quotes.toscrape.com, you want quotes from all the pages in the website.
gl: Digamos que, en vez de limitarnos a extraer cousas das primeiras dúas páxinas de http://quotes.toscrape.com, quere citas de todas as páxinas do sitio web.

source: Now that you know how to extract data from pages, let's see how to follow links from them.
gl: Agora que sabe como extraer datos de páxinas, vexamos como seguir ligazóns delas.

source: First thing is to extract the link to the page we want to follow. Examining our page, we can see there is a link to the next page with the following markup:
gl: O primeiro é extraer a ligazón á páxina que queremos seguir. Ao examinar a nosa páxina podemos ver que hai unha ligazón á páxina seguinte coas seguintes etiquetas:

source: We can try extracting it in the shell:
gl: Podemos probar a extraela desde o intérprete:

source: This gets the anchor element, but we want the attribute ``href``. For that, Scrapy supports a CSS extension that lets you select the attribute contents, like this:
gl: Isto obtén o elemento de áncora, pero queremos o atributo ``href``. Para iso Scrapy permite unha extensión de CSS que lle permite seleccionar o contido dun atributo así:

source: There is also an ``attrib`` property available (see :ref:`selecting-attributes` for more):
gl: Tamén hai dispoñíbel unha propiedade ``attrib`` (consulte :ref:`selecting-attributes` para máis información):

source: Let's see now our spider modified to recursively follow the link to the next page, extracting data from it::
gl: Vexamos agora a nosa araña modificada para seguir de maneira recursiva a ligazón á páxina seguinte, extraendo datos dela::

source: Now, after extracting the data, the ``parse()`` method looks for the link to the next page, builds a full absolute URL using the :meth:`~scrapy.http.Response.urljoin` method (since the links can be relative) and yields a new request to the next page, registering itself as callback to handle the data extraction for the next page and to keep the crawling going through all the pages.
gl: Agora, tras extraer os datos, o método ``parse()`` busca a ligazón á seguinte páxina, constrúe un URL absoluto mediante o método :meth:`~scrapy.http.Response.urljoin` (dado que as ligazóns poden ser relativas) e produce (``yield``) unha nova solicitude para a páxina seguinte, rexistrándose a si mesmo como devolución de chamada para manexar a extracción de datos da seguinte páxina e para seguir percorrendo todas as páxinas.

source: What you see here is Scrapy's mechanism of following links: when you yield a Request in a callback method, Scrapy will schedule that request to be sent and register a callback method to be executed when that request finishes.
gl: O que ve aquí é o mecanismo de Scrapy para seguir ligazóns: cando produce unha Request nun método de devolución de chamara, Scrapy planificará esa solicitude para enviala e rexistrará un método de devolución de chamada que executar cando a solicitude reciba unha resposta.

source: Using this, you can build complex crawlers that follow links according to rules you define, and extract different kinds of data depending on the page it's visiting.
gl: Deste xeito pode construír lóxicas de percorrido complexas que seguen ligazóns segundo regras definidas por vostede, e extraen distintos tipos de datos segundo a páxina que están a visitar.

source: In our example, it creates a sort of loop, following all the links to the next page until it doesn't find one -- handy for crawling blogs, forums and other sites with pagination.
gl: No exemplo, créase unha especie de bucle, seguindo todas as ligazóns á páxina seguinte ata que non se atopa ningunha máis; moi cómodo para percorrer blogs, foros e outros sitios web con paxinación.

source: A shortcut for creating Requests
gl: Un atallo para crear solicitudes

source: As a shortcut for creating Request objects you can use :meth:`response.follow <scrapy.http.TextResponse.follow>`::
gl: Como atallo para crear obxectos de Request pode usar :meth:`response.follow <scrapy.http.TextResponse.follow>`::

source: Unlike scrapy.Request, ``response.follow`` supports relative URLs directly - no need to call urljoin. Note that ``response.follow`` just returns a Request instance; you still have to yield this Request.
gl: A diferenza de scrapy.Request, ``response.follow`` permite URL relativos directamente, sen necesidade de chamar a urljoin. Teña en conta que ``response.follow`` só devolve unha instancia de Request; é responsabilidade de vostede producir (``yield``) esa instancia.

source: You can also pass a selector to ``response.follow`` instead of a string; this selector should extract necessary attributes::
gl: Tamén pode pasar a ``response.follow`` un selector en vez de unha cadea; o selector debería extraer os atributos necesarios::

source: For ``<a>`` elements there is a shortcut: ``response.follow`` uses their href attribute automatically. So the code can be shortened further::
gl: Para os elementos ``<a>`` existe un atallo: ``response.follow`` usa o seu atributo href automaticamente. O que fai posíbel abreviar aínda máis o código::

source: To create multiple requests from an iterable, you can use :meth:`response.follow_all <scrapy.http.TextResponse.follow_all>` instead::
gl: Para crear varias solicitudes desde un obxecto que se poida percorrer pode usar o método :meth:`response.follow_all <scrapy.http.TextResponse.follow_all>` no seu lugar::

source: or, shortening it further::
gl: ou, abreviando aínda máis::

source: More examples and patterns
gl: Máis exemplos e padróns

source: Here is another spider that illustrates callbacks and following links, this time for scraping author information::
gl: Aquí ten outra araña que ilustra as devolucións de chamaras e o seguimento de ligazóns, desta vez para extraer información de autores::

source: This spider will start from the main page, it will follow all the links to the authors pages calling the ``parse_author`` callback for each of them, and also the pagination links with the ``parse`` callback as we saw before.
gl: Esta araña iniciarase desde a páxina principal, e seguirá todas as ligazóns ás páxinas de autores, para logo chamar á devolución de chamada ``parse_author`` para cada unha, así como as ligazóns de paxinación coa devolución de chamada ``parse`` como xa vimos.

source: Here we're passing callbacks to :meth:`response.follow_all <scrapy.http.TextResponse.follow_all>` as positional arguments to make the code shorter; it also works for :class:`~scrapy.http.Request`.
gl: Aquí pasámoslle devolucións de chamada a :meth:`response.follow_all <scrapy.http.TextResponse.follow_all>` como argumentos de posición para acurtar o código; tamén funciona con :class:`~scrapy.http.Request`.

source: The ``parse_author`` callback defines a helper function to extract and cleanup the data from a CSS query and yields the Python dict with the author data.
gl: A devolución de chamada ``parse_author`` define unha función de asistencia para extraer e limpar os datos de unha consulta de CSS e produce o dicionario de Python cos datos do autor.

source: Another interesting thing this spider demonstrates is that, even if there are many quotes from the same author, we don't need to worry about visiting the same author page multiple times. By default, Scrapy filters out duplicated requests to URLs already visited, avoiding the problem of hitting servers too much because of a programming mistake. This can be configured by the setting :setting:`DUPEFILTER_CLASS`.
gl: Outra cousa interesante que demostra esta araña é que, aínda que houber moitas citas dun mesmo autor, non nos temos que preocupar de que acabemos visitando a páxina dun mesmo autor varias veces. De maneira predeterminada, Scrapy ignora as solicitudes a URL xa visitadas, evitando o problema de enviar solicitudes de máis aos servidores a causa de erros de programación. Isto pode configurarse mediante a opción :setting:`DUPEFILTER_CLASS`.

source: Hopefully by now you have a good understanding of how to use the mechanism of following links and callbacks with Scrapy.
gl: Con sorte a estas alturas xa vai entendendo como usar o mecanismo de seguir ligazóns e de devolucións de chamadas de Scrapy.

source: As yet another example spider that leverages the mechanism of following links, check out the :class:`~scrapy.spiders.CrawlSpider` class for a generic spider that implements a small rules engine that you can use to write your crawlers on top of it.
gl: A modo de exemplo adicional de araña que aproveita o mecanismo de seguir ligazóns, consulte a clase :class:`~scrapy.spiders.CrawlSpider`, unha araña xenérica cun pequeno motor de regras que pode usar para escribir arañas de percorrido.

source: Also, a common pattern is to build an item with data from more than one page, using a :ref:`trick to pass additional data to the callbacks <topics-request-response-ref-request-callback-arguments>`.
gl: Outro padrón habitual consiste en construír un elemento con datos de máis dunha páxina, usando un :ref:`truco para pasar datos adicionais ás devolucións de chamadas <topics-request-response-ref-request-callback-arguments>`.

source: You can provide command line arguments to your spiders by using the ``-a`` option when running them::
gl: Pode fornecer argumentos ás súas arañas desde a liña de ordes usando a opción ``-a`` ao executalas::

source: These arguments are passed to the Spider's ``__init__`` method and become spider attributes by default.
gl: Os argumentos pásanse ao método ``__init__`` da araña e de maneira predeterminada convértense en atributos da araña.

source: In this example, the value provided for the ``tag`` argument will be available via ``self.tag``. You can use this to make your spider fetch only quotes with a specific tag, building the URL based on the argument::
gl: Neste exemplo, o valor fornecido para o argumento ``tag`` estará dispoñíbel mediante ``self.tag``. Pode usar isto para facer que a súa araña só extraia citas que teñan asignada unha etiqueta concreta, construíndo o URL segundo o argumento::

source: If you pass the ``tag=humor`` argument to this spider, you'll notice that it will only visit URLs from the ``humor`` tag, such as ``http://quotes.toscrape.com/tag/humor``.
gl: Se pasa o argumento ``tag=humor`` a esta araña, verá que só visitará os URL da etiqueta ``humor``, como ``http://quotes.toscrape.com/tag/humor``.

source: You can :ref:`learn more about handling spider arguments here <spiderargs>`.
gl: Pode :ref:`aprender máis sobre manexar argumentos de arañas aquí <spiderargs>`.

source: Next steps
gl: Seguintes pasos

source: This tutorial covered only the basics of Scrapy, but there's a lot of other features not mentioned here. Check the :ref:`topics-whatelse` section in :ref:`intro-overview` chapter for a quick overview of the most important ones.
gl: Este titorial abordou os conceptos básicos de Scrapy, pero hai moitas outras funcionalidades alén das que vimos aquí. Consulte na sección :ref:`topics-whatelse` do capítulo :ref:`intro-overview` un resumo das máis importantes.

source: You can continue from the section :ref:`section-basics` to know more about the command-line tool, spiders, selectors and other things the tutorial hasn't covered like modeling the scraped data. If you prefer to play with an example project, check the :ref:`intro-examples` section.
gl: Pode continuar desde a sección :ref:`section-basics` para aprender máis sobre as ferramentas da liña de ordes, arañas, selectores e outras cousas non vistas no titorial, como modelar os datos extraídos. Se prefire fozar cun proxecto de exemplo, bote un ollo á sección :ref:`intro-examples`.
